app/controllers/orders/products_controller.rb

UPDATE "order_products" SET "amount" = ? WHERE "order_products"."id" = ?  [["amount", 2], ["id", 10]]
INSERT INTO "order_products" ("order_id", "product_id", "amount") VALUES (?, ?, ?)  [["order_id", 1], ["product_id", 1], ["amount", 1]]
---
  def update
    if @order_product.present?
      @order_product.update(count: @order_product.count + 1)
    else
      OrderProduct.create(order_id: params[:order_id], product_id: params[:id], count: 1)

DELETE FROM "order_products" WHERE "order_products"."id" = ?  [["id", 10]]
---
  def destroy
    @order_product.destroy if @order_product.present?

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_order
    @order = Order.find(params[:order_id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_products"."id" FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 1]]
---
  def find_order_product
    @order_product = OrderProduct.find_by_id(params[:id])