app/controllers/orders/products_controller.rb

DELETE FROM "order_products" WHERE "order_products"."id" = ?  [["id", 1]]
---
  def destroy
    @order_product.destroy if @order_product.present?

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_order
    @order = Order.find(params[:order_id])

SELECT "order_products".* FROM "order_products" WHERE "order_products"."product_id" = ? AND "order_products"."order_id" = ? LIMIT ?  [["product_id", 1], ["order_id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_order_product
    @order_product = OrderProduct.find_by_id(params[:id])