app/controllers/orders/products_controller.rb

UPDATE "order_products" SET "amount" = ? WHERE "order_products"."id" = ?  [["amount", 2], ["id", 1]]
INSERT INTO "order_products" ("order_id", "product_id", "amount") VALUES (?, ?, ?)  [["order_id", 1], ["product_id", 1], ["amount", 1]]
---
    def create
      if @order_product.present?
        @order_product.update(amount: @order_product.amount + 1)
      else
        OrderProduct.create(order_id: params[:order_id], product_id: params[:id], amount: 1)