app/controllers/orders/products_controller.rb

UPDATE "order_products" SET "amount" = ? WHERE "order_products"."id" = ?  [["amount", 7], ["id", 10]]
---
    def create
      if @order_product.present?
        @order_product.update(amount: @order_product.amount + 1)