app/controllers/orders_controller.rb

  def new
    order = Order.create({ customer_id: params[:customer_id] })
---
INSERT INTO "orders" ("status", "customer_id", "final_price") VALUES (?, ?, ?)  [["status", 0], ["customer_id", 1], ["final_price", 0.0]]

  def find_order
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]