app/controllers/orders_controller.rb

  def new
    order = Order.create({ customer_id: params[:customer_id] })
---
INSERT INTO "orders" ("status", "customer_id", "final_price") VALUES (?, ?, ?)  [["status", 0], ["customer_id", 1], ["final_price", 0.0]]

  def find_order
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def validate_order_products
    return unless @order.order_products.blank?
---
SELECT "order_products".* FROM "order_products" WHERE "order_products"."order_id" = ?  [["order_id", 5]]

  def check_existing_orders
    return if Order.where(customer_id: params[:customer_id], status: :open).blank?
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ? AND "orders"."status" = ?  [["customer_id", 1], ["status", 0]]