app/controllers/products_controller.rb

SELECT "combos"."id" FROM "combos" INNER JOIN "product_combos" ON "combos"."id" = "product_combos"."combo_id" WHERE "product_combos"."product_id" = ?  [["product_id", 3]]
SELECT "products"."id" FROM "products" INNER JOIN "product_combos" ON "products"."id" = "product_combos"."product_id" WHERE "product_combos"."combo_id" = ?  [["combo_id", 1]]
---
  def index
    render json: ProductSerializer.new(
      Product.where('storage_amount > 0').includes(:combos),
      {
        include: [:combos]
      }
    ).serializable_hash