app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (storage_amount > 0)
---
  def index
    render json: ProductSerializer.new(
      Product.where('storage_amount > 0').includes(:combos),
      {
        include: [:combos]
      }
    ).serializable_hash